<!-- Header -->
<?php include("../template/header.php") ?>

<body>
    <!-- Navbar -->
    <?php include("../template/navbar.php") ?>

    <!-- Body -->
    <div class="container">
        <div class="row ptop30">
            <div class="col-12">
                <b>คำสั่งตรวจสอบเงื่อนไข if else</b>
            </div>
            <div class="col-12">
                &emsp;คำสั่งตรวจสอบเงื่อนไข คือ การตรวจสอบข้อมูลเพื่อเปรียบเทียบค่าที่ต้องการแสดงผล ว่าเป็นจริง
                หรือเท็จ ถ้าเป็นจริงให้ทำแบบนี้ หรือ ไม่เป็นจริงให้ทำอีกแบบหนึ่ง เช่น หากวันนี้เป็นวันหยุดฉันจะไม่ไป
                โรงเรียน หากเป็นจริง ฉันจะไม่ไปโรงเรียน หากไม่เป็น จริง ฉันจะไปโรงเรียน หรือ ถ้าเด็กชาย มีอายุ
                มากกว่า 15 ปี ถ้าเป็นจริงให้ใช้คำนำหน้าว่า นาย ถ้าไม่เป็นจริง ให้ใช้คำนำหน้าว่า เด็กชาย เป็นต้น
            </div>
            <div class="col-12">
                &emsp;ในการเขียนโปรแกรมนั้นเราจะทำการตรวจสอบค่าของตัวแปร เพื่อให้แสดงผลข้อมูลตามเงื่อนไข
                ต่าง ๆ
            </div>
        </div>
        <div class="row ptop20">
            <div class="col-12">
                <b>คำสั่ง if</b>
            </div>
            <div class="col-12">
                &emsp;คำสั่งตรวจสอบเงื่อนไข และทำงานเมื่อเงื่อนไขเป็นจริงเท่านั้น
            </div>
            <div class="col-12">
                <img src="../image/lesson_4_1.png" class="center">
            </div>
            <div class="col-12">
                จากตัวอย่าง เราได้กำหนดค่าตัวแปร $a มีค่าเท่ากับ 10 และ $b มีค่าเท่ากับ 5<br>
                บรรทัดที่ 2 กำหนดค่าตัวแปร $a มีค่าเท่ากับ 10<br>
                บรรทัดที่ 4 กำหนดค่าตัวแปร $b มีค่าเท่ากับ 5<br>
                บรรทัดที่ 6 คำสั่ง if กำหนดเงื่อนไข $a มีค่า มากกว่า $b จริงหรือไม่ หากเป็นจริงจะทำคำสั่งในวงเล็บ { }<br>
                บรรทัดที่ 8 หาก $a มีค่ามากกว่า $b จริง จะทำคำสั่ง echo ‚Yes I Can‛ หากไม่จริงจะข้ามการทำงาน
                ส่วนนี้ไป
            </div>
        </div>
        <div class="row ptop20">
            <div class="col-12">
                <b>คำสั่ง if else</b>
            </div>
            <div class="col-12">
                &emsp;คำสั่งตรวจสอบเงื่อนไขโดยจะทำคำสั่งที่อยู่ภายใน if เมื่อเงื่อนไขเป็นจริง และทำคำสั่งที่อยู่ภายใน
                else เมื่อเงื่อนไขเป็นเท็จ
            </div>
            <div class="col-12 ptop10">
                ตัวอย่างการใช้งาน คำสั่ง if else
            </div>
            <div class="col-12">
                &emsp;กำหนดให้ตัวแปร $old มีค่าเท่ากับ 20 คำสั่ง if ตรวจสอบเงื่อนไข ถ้า ตัวแปร $old มีค่ามากกว่า
                หรือเท่ากับ 15 เป็นจริงให้ทำคำสั่งที่อยู่ภายใน if หากไม่เป็นจริงให้ทำคำสั่ง ที่อยู่ภายใน else
            </div>
            <div class="col-12">
                <img src="../image/lesson_4_2.png" class="center">
            </div>
            <div class="col-12">
                ผลการทำงาน
            </div>
            <div class="col-12">
                <img src="../image/lesson_4_3.png" class="center">
            </div>
        </div>
        <div class="row ptop20">
            <div class="col-12">
                <b>คำสั่ง if ซ้อน if</b>
            </div>
            <div class="col-12">
                &emsp;คำสั่งตรวจสอบเงื่อนไข แบบ ซับซ้อน คำสั่ง if สามารถตรวจสอบเงื่อนไขได้หลายชั
            </div>
            <div class="col-12 ptop10">
                ตัวอย่างการใช้งาน if else if
            </div>
            <div class="col-12">
                &emsp;ตัวอย่างการแบ่งเกรด โดยในคำสั่ง if จะทำการตรวจสอบเงื่อนไข ถ้าจริงจะทำงานภายในคำสั่ง
                ปีกกาของ if ถ้าไม่จริง จะตรวจสอบเงื่อนไขของ else if ไปเรื่อย ๆ ถ้าไม่ตรงกับเงื่อนไขใดเลยจะทำคำสั่งใน
                ปีกกาของ else
            </div>
            <div class="col-12">
                <img src="../image/lesson_4_4.png" class="center">
            </div>
            <div class="col-12">
                บรรทัดที่ 3 กำหนดค่า $score มีค่าเท่ากับ 10<br>
                บรรทัดที่ 5 ตรวจสอบเงื่อนไข ถ้า $score มีค่า มากกว่าหรือ เท่ากับ 85 ให้ทำคำสั่งภายในเงื่อนไขนี้<br>
                บรรทัดที่ 9 ตรวจสอบเงื่อนไข ถ้า $score มีค่า มากกว่าหรือ เท่ากับ 70 ให้ทำคำสั่งภายในเงื่อนไขนี้<br>
                บรรทัดที่ 13 ตรวจสอบเงื่อนไข ถ้า $score มีค่า มากกว่าหรือ เท่ากับ 60 ให้ทำคำสั่งภายในเงื่อนไขนี้<br>
                บรรทัดที่ 17 ตรวจสอบเงื่อนไข ถ้า $score มีค่า มากกว่าหรือ เท่ากับ 50 ให้ทำคำสั่งภายในเงื่อนไขนี้<br>
                บรรทัดที่ 21 หากไม่ตรงกับเงื่อนไขใดเลย ให้ทำคำสั่ง ภายใน else
            </div>
        </div>
        <div class="row ptop20">
            <div class="col-12">
                <b>คำสั่ง switch case</b>
            </div>
            <div class="col-12">
                &emsp;คำสั่งเพื่อใช้งานการเลือกทำงาน 1 ทางเลือกจากหลาย ๆ ทางเลือกโดยจะตรวจสอบว่าตรงกับ
                case ใด ก็จะทำงานในคำสั่งนั้น เราจะใช้คำสั่ง break เพื่อหยุดการทำงานของ case และ คำสั่ง default
                เมื่อ เงื่อนไขไม่ตรงกับ case ใด ๆ
            </div>
            <div class="col-12 ptop10">
                ตัวอย่างการใช้งาน
            </div>
            <div class="col-12">
                &emsp;ในการใช้งานคำสั่ง switch เราจำเป็นต้องระบุ คำสั่ง break หลังจากคำสั่ง case เพื่อหยุดการ
                ทำงาน หากไม่ระบุ คำสั่ง break จะแสดง case ต่อไป หลังจาก case ที่ ตรงกับเงื่อนไข และ ระบุคำสั่ง
                default เมื่อ ไม่ตรงกับเงื่อนไขใด ให้ทำงานในคำสั่ง default
            </div>
            <div class="col-12">
                <img src="../image/lesson_4_5.png" class="center">
            </div>
            <div class="col-12">
                จากตัวอย่าง กำหนดค่าตัวแปร $month มีค่าเท่ากับ 5 ตรวจสอบเงื่อนไขภายใน คำสั่ง switch หากตรงกับ
                case ใด ๆ ให้แสดงคำสั่งภายใน case นั้น
            </div>
            <div class="col-12 ptop10">
                ตัวอย่างการทำงาน
            </div>
            <div class="col-12">
                ในตัวอย่าง ตัวแปร $month มีค่าเท่ากับ 5 เมื่อทำคำสั่ง switch จะตรงกับ case ที่มีเงื่อนไขตรงกับ
                5 และหยุดการทำงาน ด้วยคำสั่ง break
            </div>
            <div class="col-12">
                <img src="../image/lesson_4_6.png" class="center">
            </div>
            <div class="col-12">
                ความแตกต่างระหว่าง คำสั่ง switch กับ คำสั่ง if else if
            </div>
            <div class="col-12">
                คำสั่ง switch สามารถตรวจสอบเงื่อนไข ของแต่ละ case โดยที่ไม่มีความเกี่ยวข้องกัน<br>
                คำสั่ง if else if จำเป็นต้องเปรียบเทียบ ค่า ว่าเป็นจริงหรือเท็จ ก่อนที่จะทำคำสั่งต่อไป
            </div>
        </div>
        <div class="row ptop20">
            <div class="col-12">
                <b>คำสั่งทำซ้า for</b>
            </div>
            <div class="col-12">
                &emsp;คำสั่ง for จะมีการวนรอบการทำงาน จนกว่าจะครบเงื่อนไขตามที่กำหนดถึงจะหยุดการทำงาน
                ตัวอย่างคำสั่ง for แสดงตัวเลข 1 ถึง 10
            </div>
            <div class="col-12">
                <img src="../image/lesson_4_7.png" class="center">
            </div>
            <div class="col-12 ptop10">
                ตัวอย่างการทำงาน
            </div>
            <div class="col-12">
                <img src="../image/lesson_4_8.png" class="center">
            </div>
            <div class="col-12">
                เราสามารถใช้คำสั่ง if เพื่อตรวจสอบเงื่อนไข และ ใช้คำสั่ง break เพื่อหยุดการทำงานของ for
                ตัวอย่าง ต้องการ แสดงตัวเลข 1 ถึง 5
            </div>
            <div class="col-12">
                <img src="../image/lesson_4_9.png" class="center">
            </div>
            <div class="col-12">
                ตัวอย่างการทำงาน
            </div>
            <div class="col-12">
                <img src="../image/lesson_4_10.png" class="center">
            </div>
        </div>
        <div class="row ptop20">
            <div class="col-12">
                <b>คำสั่ง while</b>
            </div>
            <div class="col-12">
                &emsp;คำสั่งตรวจสอบเงื่อนไขและจะวนรอบการทำงานจนกว่าเงื่อนไขจะเป็นเท็จ
            </div>
            <div class="col-12 ptop10">
                ตัวอย่างการใช้งานคำสั่ง while
            </div>
            <div class="col-12">
                <img src="../image/lesson_4_11.png" class="center">
            </div>
            <div class="col-12">
                บรรทัดที่ 3 กำหนดค่าเริ่มต้น ตัวแปร $i มีค่าเท่ากับ 1<br>
                บรรทัดที่ 5 คำสั่ง while ตรวจสอบค่า $i มี ค่าน้อยกว่า 10 ให้ทำคำสั่งด้านล่าง หรือ เท่ากับ 10 ให้หยุดการทำงาน<br>
                บรรทัดที่ 7 คำสั่ง echo แสดงค่าตัวแปร $i<br>
                บรรทัดที่ 9 ใช้ตัวดำเนินการเพิ่มค่าตัวแปร $i ทีละ 1<br>
            </div>
            <div class="col-12">
                <img src="../image/lesson_4_12.png" class="center">
            </div>
        </div>
        <div class="row ptop20">
            <div class="col-12">
                <b>คำสั่ง do while</b>
            </div>
            <div class="col-12">
                &emsp;เป็นคำสั่งวนรอบการทำงาน แต่จะทำ คำสั่ง do ก่อน หนึ่งครั้ง แล้วค่อยตรวจสอบเงื่อนไข ถ้าเป็น
                จริงจะทำต่อจนกว่าเงื่อนไขจะเป็นเท็จ และหยุดการทำงาน
            </div>
            <div class="col-12">
                <img src="../image/lesson_4_13.png" class="center">
            </div>
        </div>
    </div>

    <!-- Footer -->
    <?php include("../template/footer.php") ?>
</body>

